# Напишите программу, удаляющую из текста
# все слова, содержащие ""абв"".

# l1 = list(input('Введите символы через пробел: ').split())
# a1 = 'абв'
# l2 = [ i for i in l1 if a1 not in i]
# print(l2)



# Реализуйте RLE алгоритм: реализуйте
# модуль сжатия и восстановления данных.

# l1 = input('Введите символы: ')
# count = 0
# symb = 0
# for i in l1:
#    if symb != i:
#        if count > 0:
#            print(count, symb)
#        symb, count = i, 1
#    else:
#        count += 1
# print(count, symb)


